export type AartiContent = {
  title: string;
  content: string;
};

export const AARTI_CONTENT: AartiContent = {
  title: "श्री सत्यनारायण भगवान की आरती",
  content: `जय लक्ष्मी रमणा, श्री लक्ष्मी रमणा, सत्यनारायण स्वामी जन-पातक-हरणा॥ जय.॥ 

रत्नजटित सिंहासन अद्भुत छबि राजै । नारद करत निराजन घंटा ध्वनि बाजै॥ जय.॥ 

प्रकट भये कलि कारण, द्विज को दरस दियो। बूढ़े ब्राह्मण बनकर कंचन-महल कियो॥ जय.॥ 

दुर्बल भील कठारो, जिनपर कृपा करी। चन्द्रचूड़ एक राजा, जिनकी बिपति हरी॥ जय.॥ 

वैश्य मनोरथ पायो, श्रद्धा तज दीन्हीं। सो फल भोग्यो प्रभुजी फिर अस्तुति कीन्हीं॥ जय.॥ 

भाव-भक्ति के कारण छिन-छिन रूप धरयो। श्रद्धा धारण कीनी, तिनको काज सरयो॥ जय.॥ 

ग्वाल-बाल संग राजा वन में भक्ति करी। मनवांछित फल दीन्हों दीनदयालु हरी॥ जय.॥ 

चढ़त प्रसाद सवायो कदलीफल, मेवा। धूप-दीप-तुलसी से राजी सत्यदेवा॥ जय.॥ 

श्री सत्यनारायण जी की आरती जो कोई नर गावै। तन-मन-सुख-संपत्ति मन-वांछित फल पावै॥ जय.॥`,
};