export type HavanStep = {
  title: string;
  mantra: string;
  description?: string;
};

export type HavanSection = {
  steps: HavanStep[];
};

export const HAVAN_CONTENT: HavanSection = {
  steps: [
    {
      title: "अग्निका ध्यान तथा पूजन",
      mantra: `अग्नि प्रज़्वलितं वन्दे जातवेदं हुताशनम् । सुवर्णवर्णममलं समिध्दं सर्वतोमुखम्॥`,
      description:"'ॐ बलवर्धननामाग्नयेनमः' - मंत्र द्वारा गन्ध पुष्प आदि से पूजा करे"
    },
    {
        title:"आधार-आज्य-भाग आहुति",
        mantra:`ॐ प्रजापतये स्वाहा, इदं प्रजापतये न  मम॥
ॐ इन्द्राय स्वाहा, इदं इन्द्राये न मम॥
ॐ अग्नये स्वाहा, इदं अग्नये न मम॥
ॐ सोमाय स्वाहा, इदं सोमायन मम॥`
    },
    {
        title:"महाव्याहृति होम",
        mantra:`ॐ भूः स्वाहा, इदं भूः॥
ॐ भुवः स्वाहा, इदं भुवः॥
ॐ स्वः स्वहा, इदं स्वः ॥`
    },
    {
        title:"द्रव्यत्याग",
        mantra:`अस्मिन् होमकर्मणि याः याः यक्षमाणदेवता: ताभ्य: ताभ्य: ईदं हवानीयद्रव्यं मया परित्यक्तं तत्सद्यथादैवतमस्तु न मम ॥`,
        description:"होता के हाँथ जल से जल छोड़वाएं"
    },
    {
        title:"वराहुति होम",
        mantra:`ॐ गणानांत्वा गणपति गुंग हवामहे प्रियाणां त्वा प्रियपति  गुंग हवामहे, निधीनां त्वा निधिपति गुंग हवामहे। वसो: मम आहमजानि गर्भधम् त्वमजासि गर्भधम् ॥ स्वाहा ॥

ॐ अम्बे अम्बिके अम्बालिके नमानयति कश्चन । ससत्स्यश्वकः सुभद्रिकां काम्पीलवासिनीं॥ स्वाहा ॥`
    },
    {
        title:"नवग्रह होम",
        mantra:`ॐ आदित्याय स्वाहा, इदं आदित्याय न मम।
ॐ सोमाय स्वाहा, इदं सोमाय न मम।
ॐ भौमाय स्वाहा, इदं भौमाय न मम।
ॐ बुधाय स्वाहा, इदं बुधाय न मम।
ॐ बृहस्पतये स्वाहा, इदं बृहस्पतये न मम।
ॐ शुक्राय स्वाहा, इदं शुक्राय न मम।
ॐ शनैश्चराय स्वाहा, इदं शनैश्चराय न मम।
ॐ राहवे स्वाहा, इदं राहवे न मम।
ॐ केतवे स्वाहा, इदं केतवे न मम।`
    },
    {
        title:"प्रधान होम",
        mantra:`ॐ नमो भगवते वासुदेवाय`,
        description:"कम से कम 108 बार (एक माला) अथवा यथाशक्ति जप करके मंत्र के साथ 'स्वाहा' बोलकर जप का दशांश हवन करें।"
    },
    {
        title:"अग्नि उत्तर-पूजन",
        mantra:`ॐ स्वाहा-स्वधायुताय बलवर्धनाय अग्नये नमः॥`,
        description:"इस मंत्र से अग्नि देव का गंध आदि उपचारों से संक्षेप में उत्तर-पूजा करें"
    },
    {
        title:"स्विष्टकृद्धोम",
        mantra:`ॐ अग्नये स्विष्टकृते स्वाहा, इदं अग्नयेस्विष्टकृते न मम।`,
        description:"शेष घृत प्रोक्षणी मे डाले "
    },
    {
        title:"भू: आदि नव आहुतियाँ",
        mantra:`ॐ भूः स्वाहा, इदं भूः॥
ॐ भुवः स्वाहा, इदं भुवः॥
ॐ स्वः स्वहा, इदं स्वः ॥

ॐ त्वन्नोऽअग्ने वरुणस्य विद्वान् देवस्य हेडो अवयासि सीष्ठाः। यजिष्ठो वह्नितमः शोशुचानो विश्वा द्वेषाᳪसि प्रमुमुग्ध्यस्मत् स्वाहा, इदमग्नीवरुणाभ्याम् ॥

ॐ स त्वन्नो अग्नेऽवमो भवोती नेदिष्ठो अस्या उषसो व्युष्टौ। अवयक्ष्व नो वरुणᳪरराणो वीहि मृडीकᳪसुहवो न एधि स्वाहा, इदमग्नीवरुणाभ्याम् ॥

ॐ अयाश्चाग्नेऽस्य नभिशस्तिपाश्च सत्यमित्त्वमया असि । अया नो यज्ञᳪवहास्ययानो धेहि भेषज ᳪ स्वाहा, इदमग्नये॥

ॐ ये ते शतँवरुण ये सहस्रं यज्ञियाः पाशा वितता महान्तः। तेभिर्न्नो अद्य सवितोत विष्णुर्विश्वे मुञ्चन्तु मरुतः स्वर्काः स्वाहा, इदं वरुणाय सवित्रे विष्णवे विश्वेभ्यो देवेभ्यो मरुद्भ्यः स्वर्केभ्यः॥

ॐ उदुत्तमँव्वरुण पाशमस्मदवाधमं विमध्यमᳪश्रथाय । अथा व्वयमादित्य व्रते तवानागसो अदितये स्याम स्वाहा, इदं वरुणाय ॥

ॐ प्रजापतये स्वाहा, इदं प्रजापतये॥`
    },
      {
        title:"पूर्णाहुति",
        mantra:`ॐ पूर्णमदः पूर्णमिदं पूर्णात् पूर्णमुदच्यते। पूर्णस्य पूर्णमादाय पूर्णमेवावशिष्यते॥`
    },
  ],
};