export type PujaSubSection = {
  title: string;
  mantra: string;
  description?: string;
};

export type PujaSection = {
  items: PujaSubSection[];
};

export const PUJA_CONTENT: Record<string, PujaSection> = {
  sudhikaran: {
    items: [
      {
        title: "आचमन",
        mantra:
          "ॐ केशवाय नमः ॐ नारायणाय नमः ॐ माधवाय नमः",
        description:
          "( ‘गोविन्दाय नमः’ कहकर होठ पोंछ लें और ‘हृषीकेशाय नमः’ बोलकर हाथ धो लें । )",
      },
      {
        title: "पवित्रीकरण",
        mantra:
          "ॐ अपवित्रः पवित्रो वा सर्वावस्थां गतोऽपि वा । यः स्मरेत् पुण्डरीकाक्षं स बाह्याभ्यन्तरः शुचिः॥",
      },
      {
        title: "आसन शुद्धि",
        mantra:
          "ॐ पृथिवी त्वया धृता लोका देवि त्वं विष्णुना धृता । त्वं च धारय मां देवि पवित्रं कुरु चासनम् ॥",
        description: "( फूल अक्षत अपने आसन के नीचे डाल दें और धरती माँ को प्रणाम करें )"
      }
    ],
  },

  tilak: {
    items: [
      {
        title: "तिलक",
        mantra:
          "केशवानंत गोविन्द बाराह पुरुषोत्तम। पुण्यं यशस्यमायुष्यं तिलकं मे प्रसीदतु॥",
      },
      {
        title: "दिग्बन्धन रक्षा स्तोत्र",
        mantra:
          "पूर्वे रक्षतु वाराह आग्नेय्यां गरुडध्वजः। दक्षिणे पद्मनाभस्तु नैरृत्यां मधुसूदनः॥ पश्चिमे चैव गोविन्दो वायव्यां तु जनार्दनः। उत्तरै श्रीपति रक्षेत ऐशान्यां हि महेश्वरः॥ ऊर्ध्वं रक्षतु धाता वो ह्यधोऽनन्तश्च रक्षतु। एवं दशदिशो रक्षेत सर्वतो भगवान् हरिः॥",
        description: "पूजा या अनुष्ठान के आरम्भ में दिग्बन्धन (दिशाओं को बांधना) एक महत्वपूर्ण प्रक्रिया है ताकि दसों दिशाओं से कोई भी नकारात्मक शक्ति बाधा न डाल सके। इसे प्रायः हाथ में पीले सरसों या अक्षत लेकर मंत्र पढ़ते हुए चारों ओर छिड़क कर किया जाता है।"
      },
      {
        title: "रक्षा सूत्र (मौली)",
        mantra:
          "येन बद्धो बली राजा दानवेन्द्रो महाबलः। तेन त्वामभिबध्नामि रक्षे मा चल मा चल॥",
      },
    ]
  },

  akhandDeep: {
    items: [
      {
        title: "अखण्ड दीप",
        mantra:
          "भो दीप देव-रूपस्त्वं कर्मसाक्षि ह्यविघ्नकृत । यावत् कर्म-समाप्तिः स्यात् तावत् त्वं सुस्थिरो भवः॥",
        description: `आधार: दीपक को सीधे जमीन पर न रखें। नीचे अष्टदल कमल (चावलों से बना) या पीतल/तांबे की प्लेट में अक्षत रखें।

दिशा: दीपक की लौ पूर्व (East) दिशा की ओर होना शुभ माना जाता है (आयु वृद्धि के लिए) या उत्तर (North) दिशा की ओर (धन लाभ के लिए)।`
      },
    ]
  },

  swastivachan:{items:[
    {
        title: "स्वस्तिवाचन",
        mantra:
          `स्वस्ति न इन्द्रो वृद्ध श्रवा: स्वस्ति न पूषा विस्ववेदा:। स्वस्ति नस्तार्क्ष्यो अरिष्टनेमि: स्वस्ति नो वृहस्पति दधातु। पृषदश्वा मरुत: प्रिश्निमातर: शुभं यावानो विदथेषु जग्मय:। अग्निजिह्वा मनव: सूरचक्षसो विश्वे नो देवा अवसागमन्निह। भद्रं कर्णेभि: शृणुयाम देवा भद्रं पश्येमाक्षभिर्यजत्राः। स्थिरैरङ्गैस्तुष्टुवा ग्वंग सस्तनू भिर्व्यशेमहि देवहितं यदायु:। शतमिन्नु शरदो अन्तिदेवा यत्रा नश्चक्रा जरसं तनूनाम्। पुत्रासो यत्र पितरो भवन्ति मानो मध्या रीरिषतायुर्गन्तो:। अदितिर्द्यौरदितिरन्तरिक्ष्म दितिर्माता स पिता स पुत्र:। विश्वेदेवा अदिति: पञ्चजना अदितिर्जातमदितिर्जनित्वम्। द्यौ: शान्ति रन्तरिक्ष् ग्वंग शान्ति: पृथिवी शान्ति राप: शान्ति रोषधय: शान्ति:। वनस्पतय: शान्तिर्विश्वे देवा: शान्तिर्ब्रह्म शान्ति: सर्व ग्वंग शान्ति: शान्तिरेव शान्ति: सामा शान्तिरेधि।। यतो यत: समीहसे ततो नो अभयं कुरु शं न: कुरु प्रजाभ्यो भयं न: पशुभ्य: । सुशान्तिर्भवतु ॥ श्रीमन्महागणाधिपतये नमः। लक्ष्मीनारायणाभ्यां नम:। उमामहेश्वराभ्यां नम:। वाणीहिरण्यगर्भाभ्यां नं:।
शचिपुरन्दराभ्यां नम:। इष्टदेवताभ्यो नम:। कुलदेवताभ्यो नम:। ग्रामदेवताभ्यो नम:। वास्तुदेवताभ्यो नम:। स्थानदेवताभ्यो नम:। सर्वेभ्यो देवेभ्यो नम:। सर्वेभ्यो ब्राह्मणेभ्यो नम:। ॐ सिद्धिबुद्धिसहिताय श्री मन्महागणाधिपतये नम:।`,
      },
      {
        title:"पौराणिक श्लोक",
        mantra:"सुमुखश्चैकदन्तश्च कपिलो गजकर्णकः। लम्बोदरश्च विकटो विघ्ननाशो विनायक:॥  धूम्रकेतुर्गणाध्यक्षो भालचन्द्रो गजानन:। द्वद्शैतानि नामानि यः पठे च्छ्रिणुयादपी॥  विद्यारंभे विवाहे च प्रवेशे निर्गमे तथा। संग्रामे संकटे चैव विघ्नस्तस्य न जायते॥  शुक्लाम्बरधरं देवं शशिवर्णं चतुर्भुजम्। प्रसन्नवदनं ध्यायेत् सर्व्विघ्नोपशान्तये॥  अभिप्सितार्थ सिद्ध्यर्थं पूजितो य: सुरासुरै:। सर्वविघ्नहरस्तस्मै गणाधिपतये नम:॥  अभिप्सितार्थ सिद्ध्यर्थं पूजितो य: सुरासुरै:। सर्वविघ्नहरस्तस्मै गणाधिपतये नम:॥  सर्वमङ्गलमाङ्गल्ये शिवे सर्वार्थसाधिके। शरण्ये त्र्यम्बिकेगौरी, नारायणि नमोस्तुते॥  वक्रतुण्ड् महाकाय सूर्य कोटि समप्रभ। निर्विघ्नं कुरु में देव सर्वकार्येषु सर्वदा ॥  ॐ श्री गणेशाम्बिका भ्यां नम:॥"
      }
  ]},

  sankalp: {
    items: [
      {
        title: "संकल्प मंत्र",
        mantra: `ॐ विष्णुर्विष्णुर्विष्णुः श्रीमद्भगवतो महापुरुषस्य विष्णोराज्ञया प्रवर्तमानस्य अद्य श्रीब्रह्मणो द्वितीये परार्धे श्रीश्वेतवाराहकल्पे सप्तमे वैवस्वतमन्वन्तरे अष्टाविंशतितमे कलियुगे कलिप्रथमचरणे बौद्धावतारे भूर्लोके जम्बूद्वीपे भरतखण्डे भारतवर्षे आर्यावर्तैकदेशान्तर्गते ...अमुकक्षेत्रे विक्रमशके षष्ट्यब्दानां मध्ये ...अमुकनामसंवत्सरे, ...अमुकअयने, ...अमुकऋतौ, महामाङ्गल्यप्रदमासोत्तमे ...अमुकमासे, ...अमुकपक्षे, अमुकतिथौ, ...अमुकवासरे, ...अमुकनक्षत्रे एवं ग्रहगुणविशेषणविशिष्टायां शुभपुण्यतिथौ ...अमुकगोत्रः ...अमुकोऽहं (सपत्नीकः) ममात्मनः श्रुतिस्मृतिपुराणोक्तफलप्राप्त्यर्थम् अप्राप्तलक्ष्मीप्राप्त्यर्थं प्राप्तलक्ष्म्याश्चिरकालसंरक्षणार्थं सकलेप्सितकामनासिद्धयर्थं कायिकवाचिकमानसिकसकलदुरितोपशमनार्थं तथा आयुरारोग्यैश्वर्याभिवृद्ध्यर्थं विशेषतः भगवत्प्रीत्यर्थं श्रीसत्यनारायणस्य पूजनकथाश्रवणाख्यं कर्म करिष्ये।

तदङ्गत्वेन कार्यस्य निर्विघ्नतासिद्ध्यर्थमादौ गौरीगणेशयोः पूजनम्, कलशाराधनं तथा च नवग्रहादिदेवानां नाममन्त्रैः पूजनम् अहम् करिष्ये।`
      },
    ],
  },

  gauriGanesh:{items:[
     {
        title: "भगवान् गणेशका ध्यान",
        mantra:
          "गजाननं भूतगणादिसेवितं कपित्थजम्बूफलचारुभक्षणम् । उमासुतं शोकविनाशकारकं नमामि विघ्नेश्वरपादपङ्कजम् ॥",
      },
      {
        title: "भगवती गौरीका ध्यान",
        mantra:
          "नमो देव्यै महादेव्यै शिवायै सततं नमः । नमः प्रकृत्यै भद्रायै नियताः प्रणताः स्म ताम् ॥ श्रीगणेशाम्बिकाभ्यां नमः, ध्यानं समर्पयामि ।",
      },
      {
        title: "भगवान् गणेशका आवाहन",
        mantra:
          "एह्येहि हेरम्ब महेशपुत्र समस्तविघ्नौघविनाशद । माङ्गल्यपूजाप्रथमप्रधान गृहाण पूजां भगवन् नमस्ते ॥ ॐ भूर्भुवः स्वः सिद्धिबुद्धिसहिताय गणपतये नमः, गणपतिमावाहयामि, स्थापयामि, पूजयामि च ।",
      },
      {
        title: "भगवती गौरीका आवाहन",
        mantra:
          "ॐ हेमाद्रितनयां देवीं वरदां शङ्करप्रियाम् । लम्बोदरस्य जननीं गौरीमावाहयाम्यहम् ॥ ॐ भूर्भुवः स्वः गौर्यै नमः, गौरीमावाहयामि, स्थापयामि, पूजयामि च ।",
      },
      {
        title: "प्रतिष्ठा",
        mantra:
           "अस्यै प्राणाः प्रतिष्ठन्तु अस्यै प्राणाः क्षरन्तु च । अस्यै देवत्वमर्चायै मामहेति च कश्चन ॥ गणेशाम्बिके! सुप्रतिष्ठिते वरदे भवेताम् ।",
      },
      {
        title: "पाद्य",
        mantra:
          "ॐ सर्वतीर्थसमुदभूतं पाद्यं गन्धादिभिर्युतम्। विघ्नराज ! गृहाणेमं भगवन् ! भक्तवत्सलः।। ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, पादयोः पाद्यं समर्पयामि ।",
      },
      {
        title: "अर्घ्य",
        mantra:
           "ॐ गणाध्यक्ष! नमस्तेऽस्तु गृहाण करुणाकर । अर्घ्यं च फल संयुक्तं गन्धपुष्पाक्षतैर्युतम्।। ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, हस्तयोर्घ्यं समर्पयामि ।",
      },
      {
        title: "आचमन",
        mantra:
          "ॐविनायक! नमस्तुभ्यं त्रिदशैरभिवन्दित। गंगोदकेन देवेश कुरुष्वाचमनं प्रभो।। ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, मुखे आचमनीयं समर्पयामि ।",
      },
      {
        title: "स्नान",
        mantra:
          "गंगे च यमुने चैव गोदावरि सरस्वति, नर्मदे सिंधु कावेरी जलेऽस्मिन्‌ सन्निधिं कुरु ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, स्नानं समर्पयामि ।",
      },
      {
        title: "पञ्चामृतस्नान",
        mantra:
          "पञ्चामृतं मयानीतं पयो दधि घृतं मधु । शर्करया समायुक्तं स्नानार्थं प्रतिगृह्यताम् ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, पञ्चामृतस्नानं समर्पयामि ।",
      },
      {
        title: "शुद्धोदकस्नान",
        mantra:
          "ॐ मन्दाकिन्यास्तु यद्वारि सर्वपापहरं शुभम्। तदिदं कल्पितं देव ! स्नानार्थं प्रतिगृह्यताम्।। ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, शुद्धोदकस्नानं समर्पयामि । शुद्धोदकस्नानान्ते आचमनीयं जलं समर्पयामि ।",
      },
      {
        title: "वस्त्र",
        mantra:
          "शीतवातोष्णसंत्राणं लज्जाया रक्षणं परम् । देहालङ्करणं वस्त्रमतः शान्तिं प्रयच्छ मे ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, वस्त्रं च उपवस्त्रं समर्पयामि । वस्त्रान्ते आचमनीयं जलं समर्पयामि ।",
      },
      {
        title: "यज्ञोपवीत",
        mantra:
          "नवभिस्तन्तुभिर्युक्तं त्रिगुणं देवतामयम् । उपवीतं मया दत्तं गृहाण परमेश्वर ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, यज्ञोपवीतं समर्पयामि । यज्ञोपवीतान्ते आचमनीयं जलं समर्पयामि ।",
      },
      {
        title: "चन्दन",
        mantra:
          "श्रीखण्डं चन्दनं दिव्यं गन्धाढ्यं सुमनोहरम् ।विलेपनं सुरश्रेष्ठ! चन्दनं चन्दनं प्रतिगृह्यताम् ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, चन्दनानुलेपनं समर्पयामि।",
      },
      {
        title: "अक्षत",
        mantra:
          "अक्षताश्च सुरश्रेष्ठ कुङ्कुमाक्ता: सुशोभिताः । मया निवेदिता भक्त्या गृहाण परमेश्वर ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, अक्षतान् समर्पयामि ।",
      },
      {
        title: "पुष्पमाला",
        mantra:
          "माल्यादीनि सुगन्धीनि मालत्यादीनि वै प्रभो । मयाहृतानि पुष्पाणि पूजार्थं प्रतिगृह्यताम् ॥ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, पुष्पमालां समर्पयामि।",
      },
      {
        title: "दूर्वा",
        mantra:
          "दूर्वाङ्कुरान् सुहरितानमृतान् मङ्गलप्रदान् । आनीतांस्तव पूजार्थं गृहाण गणनायक ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, दूर्वाङ्कुरान् समर्पयामि ।",
      },
      {
        title: "सिन्दूर",
        mantra:
          "सिन्दूरं शोभनं रक्तं सौभाग्यं सुखवर्धनम् । शुभदं कामदं चैव सिन्दूरं प्रतिगृह्यताम् ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, सिन्दूरं समर्पयामि ।",
      },
      {
        title: "अबीर-गुलाल आदि नाना परिमल द्रव्य",
        mantra:
          "अबीरं च गुलालं च हरिद्रादिसमन्वितम् । नाना परिमलं द्रव्यं गृहाण परमेश्वर ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, नानापरिमलद्रव्याणि समर्पयामि।",
      },
      {
        title: "धूप",
        mantra:
          "वनस्पतिरसोद्भूतो गन्धाढ्यो गन्ध उत्तमः। आघ्रेयः सर्वदेवानां धूपोऽयं प्रतिगृह्यताम् ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, धूपमाघ्रापयामि ।",
      },
      {
        title: "दीप",
        mantra:
          "साज्यं च वर्तिसंयुक्तं वह्निना योजितं मया । दीपं गृहाण देवेश त्रैलोक्यतिमिरापहम् ॥ भक्त्या दीपं प्रयच्छामि देवाय परमात्मने । त्राहि मां निरयाद् घोराद् दीपज्योतिर्नमोऽस्तु ते ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, दीपं दर्शयामि ।",
      },
      {
        title: "नैवेद्य",
        mantra:
          "शर्कराखण्डखाद्यानि दधिक्षीरघृतानि च। आहारं भक्ष्यभोज्यं च नैवेद्यं प्रतिगृह्यताम् ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, नैवेद्यं निवेदयामि | नैवेद्यान्ते आचमनीयं जलं समर्पयामि ।",
      },
       {
        title: "ऋतुफल",
        mantra:
          "इदं फलं मया देव स्थापितं पुरतस्तव । तेन मे सफलावाप्तिर्भवेज्जन्मनि जन्मनि ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, ऋतुफलानि समर्पयामि। फलान्ते आचमनीयं जलं समर्पयामि ।",
      },
       {
        title: "ताम्बूल",
        mantra:
          "पूगीफलं महद्दिव्यं नागवल्लीदलैर्युतम् । एलादिचूर्णसंयुक्तं ताम्बूलं प्रतिगृह्यताम् ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, मुखवासार्थम् एलालवंग - पूगीफलसहितं ताम्बूलं समर्पयामि ।",
      },
      {
        title: "दक्षिणा",
        mantra:
          "हिरण्यगर्भगर्भस्थं हेमबीजं विभावसोः । अनन्तपुण्यफलदमतः शान्तिं प्रयच्छ मे ॥ ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, कृताया: पूजायाः साद्गुण्यार्थे द्रव्यदक्षिणां समर्पयामि।",
      },
      {
        title: "पुष्पाञ्जलि",
        mantra:
          "नानासुगन्धिपुष्पाणि यथाकालोद्भवानि च । पुष्पाञ्जलिर्मया दत्तो गृहाण परमेश्वर || ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, पुष्पाञ्जलिं समर्पयामि ।",
      },
      {
        title: "विशेषार्घ्य",
        mantra:
          "रक्ष रक्ष गणाध्यक्ष रक्ष त्रैलोक्यरक्षक । भक्तानामभयं कर्ता त्राता भव भवार्णवात् ॥ द्वैमातुर कृपासिन्धो षाण्मातुराग्रज प्रभो । वरदस्त्वं वरं देहि वाञ्छितं वाञ्छितार्थद ॥ अनेन सफलार्घ्येण वरदोऽस्तु सदा मम । ॐ भूर्भुवः स्वः गणेशाम्बिकाभ्यां नमः, विशेषार्घ्यं समर्पयामि ।",
      },
  ]}
} as const;

export type PujaSectionId = keyof typeof PUJA_CONTENT;