export type VisarjanStep = {
  title: string;
  mantra: string;
};

export type VisarjanContent = {
  steps: VisarjanStep[];
};

export const VISARJAN_CONTENT: VisarjanContent = {
  steps: [
    {
        title:"पुष्पांजलि",
        mantra:"नानासुगन्धिपुष्पाणि यथाकालोद्भवानि च। पुष्पाञ्जलिर्मया दत्तो गृहाण परमेश्वर॥ कायेन वाचा मनसेन्द्रियैर्वा बुद्ध्यात्मना वा प्रकृतिस्वभावात्। करोमि यद्यत्सकलं परस्मै नारायणायैति समर्पयामि॥"
    },
    {
      title: "क्षमा प्रार्थना",
      mantra: `
अपराध सहस्राणि क्रियन्तेऽहर्निशं मया।
दासोऽयं इति मां मत्वा क्षमस्व परमेश्वर॥

आवाहनं न जानामि न जानामि विसर्जनम्।
पूजां चैव न जानामि क्षम्यतां परमेश्वर॥
      `,
    },
    {
      title: "विसर्जन मंत्र",
      mantra: `
यान्तु देवगणाः सर्वे पूजामादाय मामकीम्।
इष्टकामसमृद्ध्यर्थं पुनरागमनाय च॥

गच्छ गच्छ सुरश्रेष्ठ स्वस्थाने परमेश्वर।
यत्र ब्रह्मादयो देवास्तत्र गच्छ हुताशन॥
      `,
    },
    {
        title:"चरणामृत-ग्रहण",
        mantra:"अकालमृत्युहरणं सर्वव्याधिविनाशनम्। विष्णुपादोदकं पीत्वा पुनर्जन्म न विद्यते॥"
    },
    {
        title:"तुलसी-ग्रहण",
        mantra:"विष्णुप्रियां महादेवीं तुलसीं सस्यमञ्जरीम्। पूजनान्ते प्रसादेन भक्षयामि सदा शुभाम्॥"
    }
  ],
};